Revit 2024 API
StructuralSectionConcreteT Class
 Defines parameters for parameterized concrete T structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class StructuralSectionConcreteT : StructuralSectionRectangular
Visual Basic
Public Class StructuralSectionConcreteT _
	Inherits StructuralSectionRectangular
Visual C++
public ref class StructuralSectionConcreteT : public StructuralSectionRectangular
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteT
See Also
StructuralSectionConcreteT Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace